Revit 2027 API
DGNExportOptions.GetExportLineweightTable Method
 Gets a copy of the line weight table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLineweightTable GetExportLineweightTable()
Public Function GetExportLineweightTable As ExportLineweightTable
public:
ExportLineweightTable^ GetExportLineweightTable()
member GetExportLineweightTable : unit -> ExportLineweightTable
Return Value
ExportLineweightTable
 The line weight table.
See Also
Reference
DGNExportOptions Class
Autodesk.Revit.DB Namespace